cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFAAxN.xml
        <!-- REGISTER "PPGC2" -->
        <register derivedFrom="PPGC0">
          <name>PPGC2</name>
          <description>PPG Operation Mode Control Register 2</description>
          <addressOffset>0x205</addressOffset>
        </register>
        <!-- REGISTER "PPGC3" -->
        <register derivedFrom="PPGC0">
          <name>PPGC3</name>
          <description>PPG Operation Mode Control Register 3</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "PPGC4" -->
        <register derivedFrom="PPGC0">
          <name>PPGC4</name>
          <description>PPG Operation Mode Control Register 4</description>
          <addressOffset>0x241</addressOffset>
        </register>
        <!-- REGISTER "PPGC5" -->
        <register derivedFrom="PPGC0">
          <name>PPGC5</name>
          <description>PPG Operation Mode Control Register 5</description>
          <addressOffset>0x240</addressOffset>
        </register>
        <!-- REGISTER "PPGC6" -->
        <register derivedFrom="PPGC0">
          <name>PPGC6</name>
          <description>PPG Operation Mode Control Register 6</description>
          <addressOffset>0x245</addressOffset>
        </register>
        <!-- REGISTER "PPGC7" -->
        <register derivedFrom="PPGC0">
          <name>PPGC7</name>
          <description>PPG Operation Mode Control Register 7</description>
          <addressOffset>0x244</addressOffset>
        </register>
        <!-- REGISTER "PRLH0" -->
        <register>
          <name>PRLH0</name>
          <description>PPG0 Reload Registers High</description>
          <addressOffset>0x209</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLH" -->
            <field>
              <name>PRLH</name>
              <description>Reload Registers High</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLL0" -->
        <register>
          <name>PRLL0</name>
          <description>PPG0 Reload Registers Low</description>
          <addressOffset>0x208</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLL" -->
            <field>
              <name>PRLL</name>
              <description>Reload Registers Low</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLH1" -->
        <register derivedFrom="PRLH0">
          <name>PRLH1</name>
          <description>PPG1 Reload Registers High</description>
          <addressOffset>0x20D</addressOffset>
        </register>
        <!-- REGISTER "PRLL1" -->
        <register derivedFrom="PRLL0">
          <name>PRLL1</name>
          <description>PPG1 Reload Registers Low</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "PRLH2" -->
        <register derivedFrom="PRLH0">
          <name>PRLH2</name>
          <description>PPG2 Reload Registers High</description>
          <addressOffset>0x211</addressOffset>
        </register>
        <!-- REGISTER "PRLL2" -->
        <register derivedFrom="PRLL0">
          <name>PRLL2</name>
          <description>PPG2 Reload Registers Low</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "PRLH3" -->
        <register derivedFrom="PRLH0">
          <name>PRLH3</name>
          <description>PPG3 Reload Registers High</description>
          <addressOffset>0x215</addressOffset>
        </register>
        <!-- REGISTER "PRLL3" -->
        <register derivedFrom="PRLL0">
          <name>PRLL3</name>
          <description>PPG3 Reload Registers Low</description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "PRLH4" -->
        <register derivedFrom="PRLH0">
          <name>PRLH4</name>
          <description>PPG4 Reload Registers High</description>
          <addressOffset>0x249</addressOffset>
        </register>
        <!-- REGISTER "PRLL4" -->
        <register derivedFrom="PRLL0">
          <name>PRLL4</name>
          <description>PPG4 Reload Registers Low</description>
          <addressOffset>0x248</addressOffset>
        </register>
        <!-- REGISTER "PRLH5" -->
        <register derivedFrom="PRLH0">
          <name>PRLH5</name>
          <description>PPG5 Reload Registers High</description>
          <addressOffset>0x24D</addressOffset>
        </register>
        <!-- REGISTER "PRLL5" -->
        <register derivedFrom="PRLL0">
          <name>PRLL5</name>
          <description>PPG5 Reload Registers Low</description>
          <addressOffset>0x24C</addressOffset>
        </register>
        <!-- REGISTER "PRLH6" -->
        <register derivedFrom="PRLH0">
          <name>PRLH6</name>
          <description>PPG6 Reload Registers High</description>
          <addressOffset>0x251</addressOffset>
        </register>
        <!-- REGISTER "PRLL6" -->
        <register derivedFrom="PRLL0">
          <name>PRLL6</name>
          <description>PPG6 Reload Registers Low</description>
          <addressOffset>0x250</addressOffset>
        </register>
        <!-- REGISTER "PRLH7" -->
        <register derivedFrom="PRLH0">
          <name>PRLH7</name>
          <description>PPG7 Reload Registers High</description>
          <addressOffset>0x255</addressOffset>
        </register>
        <!-- REGISTER "PRLL7" -->
        <register derivedFrom="PRLL0">
          <name>PRLL7</name>
          <description>PPG7 Reload Registers Low</description>
          <addressOffset>0x254</addressOffset>
        </register>
        <!-- REGISTER "GATEC0" -->
        <register>
          <name>GATEC0</name>
          <description>PPG Gate Function Control Registers 0</description>
          <addressOffset>0x218</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG2" -->
            <field>
              <name>STRG2</name>
              <description>Select a trigger for PPG2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE2" -->
            <field>
              <name>EDGE2</name>
              <description>Select Start Effective Level for PPG2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG0" -->
            <field>
              <name>STRG0</name>
              <description>Select a trigger for PPG0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE0" -->
            <field>
              <name>EDGE0</name>
              <description>Select Start Effective Level for PPG0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC4" -->
        <register>
          <name>GATEC4</name>
          <description>PPG Gate Function Control Registers 4</description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG6" -->
            <field>
              <name>STRG6</name>
              <description>Select a trigger for PPG6</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE6" -->
            <field>
              <name>EDGE6</name>
              <description>Select Start Effective Level for PPG6</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG4" -->
            <field>
              <name>STRG4</name>
              <description>Select a trigger for PPG4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE4" -->
            <field>
              <name>EDGE4</name>
              <description>Select Start Effective Level for PPG4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IGBTC" -->
        <register>
          <name>IGBTC</name>
          <description>IGBT Mode Control Register</description>
          <addressOffset>0x380</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IGATIH" -->
            <field>
              <name>IGATIH</name>
              <description>Stop prohibition mode selection in output active bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGNFW" -->
            <field>
              <name>IGNFW</name>
              <description>Noise filter width selection bit </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGOSEL" -->
            <field>
              <name>IGOSEL</name>
              <description>Output level selection bit </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGTRGLV" -->
            <field>
              <name>IGTRGLV</name>
              <description>Trigger input level selection bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGBTMD" -->
            <field>
              <name>IGBTMD</name>
              <description>IGBT mode selection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
